
{
	"topics" : [
			
		{
			"topictitle": "Things we're still allowed to ask you about",
			"subscribed" : 0,
			"publictags" : [],
			"privatetags" : [],
			"responses" : [

				{ 

		 			"id": 1,
		 			"parentid": 0,
		 			"depth": 0,
		 			"age": "25803",
		 			"author": "50.144.172.163",
		 			"posttext": "<p>Jimbo, since we are apparently no longer allowed to ask you about the Kazakh Wikipedia, and we are no longer allowed to ask you about your payments of prize money to Wikipedians of the Year, could we still ask you if you've made any progress on <a>this matter</a> that you said 41 days ago would have a resolution time of \"within a week\"? </p>"
				}
			]
		},
		{
			"topictitle": "No basis for crying sexism other than blind assumption of bad faith",
			"subscribed" : 0,
			"publictags" : [],
			"privatetags" : [],
			"responses" : [
				{

		 			"id": 3,
		 			"parentid": 0,
					"depth": 0,
					"age": "249960",
					"author": "The Devil's Advocate",
					"posttext": "<p>I see that the editor who created this category and did most of this has responded by creating similar cats for men. This is not a simple matter of the editor responding to controversy, however as some would certainly claim. He has created categories for men and women well before this. As can be seen in one instance back in February he created a cat for <a>German male dancers</a> immediately after creating a cat for <a>German female dancers</a>. Similarly, he created a cat for <a>male film actors</a> and one for <a>film actresses</a> within a month. He also created the general cat for <a>American male actors</a> a month and a half before creating the cat for <a>American actresses</a>. Now then, we can all stop buying into the scaremongering from some random \"feminist\" who lacks any amount of circumspection and thus is quick to assume everything is about sexism. Let no one ever claim again that editors on Wikipedia actually assume good faith. No, we jump to conclusions and have the rope ready before the defendant ever gets a chance to speak.</p>"
				},
				{

		 			"id": 4,
		 			"parentid": 3,
					"depth": 1,
					"age": "249762",
					"author": "Delicious Carbuncle",
					"posttext": "<p>I'm glad you put \"feminist\" in quotation marks so that people know to ignore your opinion on this issue from here on in.</p>"
				},

				{

		 			"id": 5,
		 			"parentid": 4,
					"depth": 2,
					"age": "249362",
					"author": "The Devil's Advocate",
					"posttext": "<p>A feminist is supposed to advocate for equality and part of that should be giving men the same amount of consideration one would give a women. Someone who is so quick to presume a situation is about men trying to demean women is not acting in a manner consistent with her proclaimed creed. Were a female editor doing this with men you would undoubtedly find certain self-proclaimed feminists less likely to notice, less likely to care, and more likely to consider less demeaning explanations. Most identity politics nowadays is about some person assuming the worst, stirring up a controversy, and calling for heads to roll. It really takes away from the goal of equality.</p>"
				},

				{

		 			"id": 6,
		 			"parentid": 5,
					"depth": 3,
					"age": "249262",
					"author": "Delicious Carbuncle",
					"posttext": "<p>I rest my case.</p>"
				},

				{

		 			"id": 7,
		 			"parentid": 6,
					"depth": 4,
					"age": "249162",
					"author": "The Devil's Advocate",
					"posttext": "<p>I generally detest using identity politics as a way of whipping up an angry mob to attack and demean individuals without any meaningful consideration of guilt or innocence. If you want to say that makes me less of a person or a person with an opinion less worthy of consideration then fine. However, people shouldn't be labeling an editor a sexist and calling for bans based entirely on some random crap they read in the news.</p>"
				},

				{

		 			"id": 8,
		 			"parentid": 7,
					"depth": 5,
					"age": "248562",
					"author": "Delicious Carbuncle",
					"posttext": "<p>Has anyone labelled an editor \"sexist\"? Has anyone (other than Jimbo) suggested banning anyone in relation to this incident?</p>"
				},
				{ 

		 			"id": 9,
		 			"parentid": 7,
		 			"depth": 5,
		 			"age": "248462",
		 			"author": "AndyTheGrump",
		 			"posttext": "<p>Just out of curiosity, is someone proposing to create <a>:Category:non-African-American television actors</a>? </p>"
				},
				{ 

		 			"id": 10,
		 			"parentid": 3,
		 			"depth": 1,
		 			"age": "224222",
		 			"author": "Johnpacklambert",
		 			"posttext": "<p>I did not create <a>:Category:American women novelists</a>. Nor were was it my edits that made it so <a>Amy Tan</a> was in that category. Nor was Amy Tan in <a>:Category:American novelists</a> before being placed in <a>:Category:American women novelists</a>. Just because I added a lot of pages to the category does not mean that I created it. I find it very objectionable that people here at wikipedia are so concerned about their image that they would even suggest banning an editor just because the edits he did caused some ob-ed writer to write ill of wikipedia. The edits were completely in line with policy, <a>:Category:American novelists</a> has many genre-specific sub-cats and is not the bottom rung. People are willing to let the misrepresentation of the matter by the New York Times color the issue and then call for banning someone with no good procedural grounds to do it. That is heavy handed disregard for the editors who actually create wikipedia by actually paying attention to policies. No policies were borken, and to call for banning someone in this case is totally unreasonable.</p>"
				},
				{ 

		 			"id": 11,
		 			"parentid": 10,
		 			"depth": 2,
		 			"age": "82082",
		 			"author": "Burkehart",
		 			"posttext": "<p>THE STATEMENT ABOVE BY Johnpacklambert is incorrect (although he may be unaware of this). Amy Tan was removed from “American novelists” on 13 September last year (and put into the category “American novelists of Asian descent”) and added to “American women novelists” by a different editor on 24 March. Here are the dates of these two edits: http://en.wikipedia.org/w/index.php?title=Amy_Tan&diff=next&oldid=510787230 http://en.wikipedia.org/w/index.php?title=Amy_Tan&diff=next&oldid=543063880 — Preceding <a>unsigned</a> comment added by </p>"
				},
				{ 

		 			"id": 12,
		 			"parentid": 10,
		 			"depth": 2,
		 			"age": "223862",
		 			"author": "Johnpacklambert",
		 			"posttext": "<p>That said people are totally ignoring what I was doing. I was primarily in the process of dividing <a>:Category:Women novelists</a> into its varioussub-categories. As it was, some of the people in <a>:Category:Women novelists</a> were not in any nationality categories. Many of the people currently in <a>:Category:Australian women novelsits</a> were not in <a>:Category:Australian novelists</a> before the move. People have entirely misrepresented what I did. Some people seem to want to drive off editors who help wikipedia.</p>"
				},
				{ 

		 			"id": 13,
		 			"parentid": 3,
		 			"depth": 1,
		 			"age": "217322",
		 			"author": "Johnpacklambert",
		 			"posttext": "<p>For what it is worth, I did not create <a>:Category:American women novelists</a>, <a>:Category:Women novelsits by nationality</a> or <a>:Category:Women novelists</a>. I believe I have created most other sub-cats of <a>:Category:Women novelists by nationality</a>, inclduing <a>:Category:Haitian women novelists</a>. I also did not create <a>:Category:American men novelists</a>. I did create <a>:Category:British men novelists</a>, but that was jsut because I figured that we should not confine such things to the US. My main goal was to split <a>:Category:Women novelists</a> into usable parts. Actually, there is another point. <a>:Category:Haitain novelists</a> for a time had no one in it, while <a>:Category:American novelists</a> has never come anywhere near that. So why is all the outrage about the American category? This seems alot like narrow nationalism. Of course, the American category is also disproprotionately large by any measure. There are only 157 articles in <a>:Category:Chinese novelists</a> and all its sub-cats, and that is assuming there is no overlap. There are over 4,000 in <a>:Category:American novelists</a>, how much over is hard to tell because I do not know what percentage of <a>:Category:American historical novelists</a> or other sub-cats overlap with the parent.</p>"
				},
				{ 

		 			"id": 14,
		 			"parentid": 13,
		 			"depth": 2,
		 			"age": "70202",
		 			"author": "Obiwankenobi",
		 			"posttext": "<p>Here is one I saw:<a>says JPLs actions are racist and sexist and disgusting</a>, <a>expresses a wish that the press will criticize JPL even more</a>. Outside the wiki, on twitter and blogs, the term sexist has been bandied about a whole lot, and in some cases applied to JPL. In my own little defense of JPL, I've followed him for a long time, and he is both an active editor and active contributor for several years now to CfD discussions - which most of these johnny-come-latelys barely know exists. I don't agree with all of his views, but he is a solid contributor and knows a hell of lot more about categorization that most people I've seen in this discussion, and has been applying that knowledge and work to help clean up cats in wikipedia. He is actually quite knowledgeable about different cultures and ethnicities, and is often fighting for more precise categorization of things so as not to gloss over cultural differences (for example, he argues strongly against categorization schemes based on race like <i>Black so-and-so</i>.) So the flak he is receiving is completely not deserved.</p>"
				},
				{ 

		 			"id": 15,
		 			"parentid": 3,
		 			"depth": 1,
		 			"age": "189122",
		 			"author": "Johnpacklambert",
		 			"posttext": "<p><b>Comment</b> Much of the rhetoric about this category ignores articles like <a>Emily M. Danforth</a> that was created with the <a>:Category:American women novelists</a> and not <a>:Category:American novelists</a>, long before I started adding large numbers of articles to this category. I did not create this category, nor was I the first person to put people in it but not its national specific parent category. In some ways I think it would help if there were better ways to trace the history of categories, so we could see how large they were at given times.</p>"
				}
			]
		},
		{
			"topictitle": "John Le Mesurier talk page",
			"subscribed" : 0,
			"publictags" : [],
			"privatetags" : [],
			"responses" : [

				{ 

		 			"id": 16,
		 			"parentid": 0,
		 			"depth": 0,
		 			"age": "521402",
		 			"author": "JohnClarknew",
		 			"posttext": "<p>Mr. Wales, if you have a moment, would you be so kind as to take a glance at <a>Talk:John Le Mesurier</a>. There is a nasty quite unnecessary brutal exchange going on there, which involves the existence of me, the validation of <a>Just William</a> and now borders on elder abuse! I have asked for neutral arbitration, but it would be nice to think you know what's going on down there. Thank you. </p>"
				},
				{ 

		 			"id": 17,
		 			"parentid": 16,
		 			"depth": 1,
		 			"age": "517142",
		 			"author": "Canoe1967",
		 			"posttext": "<p>I just did a quick read of the talk page. It seems that John Clark may warrant inclusion in the article. They have asked for a source. User:JohnClarknew has provided one and they keep deleting the url from the talk page claiming it is promotional of the magazine that he is trying to use as a source. Do we delete links to other magazines from talk pages because they try to sell you copies on their websites?</p>"
				},
				{ 

		 			"id": 18,
		 			"parentid": 16,
		 			"depth": 1,
		 			"age": "515342",
		 			"author": "JohnClarknew",
		 			"posttext": "<p>Thank you, Canoe 1967. You are the voice of reason and common sense. This article has a long list of the subject's co-stars and co-featured players, so I think it is of interest to the reader to see the inclusion of John Clark as part of that list. Objection was unwarranted from the start. So they say it lacked a source? I have provided one, which includes a photograph of me, Le Mesurier as the character Uncle Noel, and his signature; what could be better? So then they changed their tune, and started insulting me with accusations which you can read. Finally, when one of them used my age (80) as somehow relevant in disparaging terms, holding me in disrepute, that, Delicious Carbuncle, is a form of elder abuse. Not criminal, but actionable. </p>"
				},
				{ 

		 			"id": 19,
		 			"parentid": 18,
		 			"depth": 2,
		 			"age": "516422",
		 			"author": "SchroCat",
		 			"posttext": "<p>That is something of a misreading of the situation. The information was originally removed from the article after the COI inclusion because there was no source (which was also a BLP problem). It's not the only reason for not including it: it's a piece of trivia of such minute proportions that if shouldn't be included, source or no source. JLM was in over a hundred films, for example, and we don't even list all of them, so why would we include an obscure unknown from a minor radio play in the 194os? </p>"
				},
				{ 

		 			"id": 20,
		 			"parentid": 19,
		 			"depth": 3,
		 			"age": "516242",
		 			"author": "SchroCat",
		 			"posttext": "<p>(a second brief correction: the information that was deleted was a plug for subscriptions to an obscure society, and failed on <a>wp:notadvertising</a> grounds.) </p>"
				},
				{ 

		 			"id": 21,
		 			"parentid": 20,
		 			"depth": 4,
		 			"age": "514862",
		 			"author": "Irondome",
		 			"posttext": "<p>I think you should just be a little philosophical here John. Remember JLM never even recieved a credit in Ben Hur for his beautifully crafted little characterisation of the Greek doctor at the end of the chariot scene. The JLM I recall (vaguely and from a respectful distance) during my time in Ramsgate in the 70s and 80s would have just given one of those slight, almost sad smiles he did. Dont worry about it. You may have a case for insertion, but someone else should do it and the usual WP rules should apply. I think the process of consensus building and discussion has broken here. I hope it is repaired. Its not always a good idea to bring such things to large forums such as this. Some wise advice I got from a fellow Ed. Keep things small and quiet on WP. </p>"
				},
				{ 

		 			"id": 22,
		 			"parentid": 21,
		 			"depth": 5,
		 			"age": "513542",
		 			"author": "SchroCat",
		 			"posttext": "<p>I'd disagree on the inclusion: adding the name of a minor unknown really is rather pointless: so much has been removed from the article to make it readable (including the names of most of his films, stage shows and tv and radio broadcasts, that adding this information really adds nothing to the background or understanding of Le Mez, but seems to be little more than an ego trip. </p>"
				},
				{ 

		 			"id": 23,
		 			"parentid": 22,
		 			"depth": 6,
		 			"age": "513002",
		 			"author": "Canoe1967",
		 			"posttext": "<p>http://www.justwilliamsociety.co.uk/page-willsoc-magazine.htm is the link in question. If the magazine is a foremost authority on Just William then it could be used as a source. Mentioning an editors age on an article talk page probably warrants a revdel as outing. If the magazine is accepted as an RS then inclusion of John Clark in the article could be discussed if the connection between the article subject and John Clark is notable. I haven't looked into detail on the connection.</p>"
				},
				{ 

		 			"id": 24,
		 			"parentid": 23,
		 			"depth": 7,
		 			"age": "496322",
		 			"author": "JohnClarknew",
		 			"posttext": "<p>The Society is indeed the foremost authority on the creation of <a>Richmal Crompton</a>'s loveable rascal. They meet once a year, and online. The magazine can be obtained for £10, and there's no need to participate in any activity. Back copies for £3.50, members only, and they exist barely as a non-profit, just like WP. They could do with donations too! I and <a>Martin Jarvis</a> who is famous for reading the stories on BBC radio and audiobooks, are honorary members, and we feel honored to have been asked. </p>"
				},
				{ 

		 			"id": 25,
		 			"parentid": 24,
		 			"depth": 8,
		 			"age": "511862",
		 			"author": "SchroCat",
		 			"posttext": "<p>There's no outing here, the editor has <a>their own article</a> (which they created), as well as their user page. It's the connection that is part of the issue: it's minor and fleeting <i>at best</i> in the career of JLM. In terms of inclusion of any more info into the article, there are several thousand other actors, films, TV and radio broadcasts which would come further up the chain that this. </p>"
				},
				{ 

		 			"id": 26,
		 			"parentid": 25,
		 			"depth": 9,
		 			"age": "511562",
		 			"author": "Irondome",
		 			"posttext": "<p>It is irrelevant now. Quite apart from the facts above, I subsequently noted JLM has a seperate professional bio page, so I just deleted my original drone. </p>"
				},
				{ 

		 			"id": 27,
		 			"parentid": 16,
		 			"depth": 1,
		 			"age": "508682",
		 			"author": "Irondome",
		 			"posttext": "<p>John. Why dont you and some other editors improve the rather shaky (at the moment) <a>Just William</a> article. It could do with clean up reorganisation and a portrayal of William on screen and radio section, and you could it would seem quite legitimately go in there. Based on an old R/T <a>Radio Times</a> listing that could be sourced to everyones satisfaction. I do not know how much the JLM connection means to you, but if you disconnect from that, it looks like you can legitimately be in and help improve a potentially good article, which actually direct involves an obviously very important role in your professional career. In that sense I think notability and other stuff would be satisfied? In the opinion of other Eds and if John was in agreement could this provide consensus for a new direction for this issue? </p>"
				},
				{ 

		 			"id": 28,
		 			"parentid": 16,
		 			"depth": 1,
		 			"age": "508682",
		 			"author": "Irondome",
		 			"posttext": "<p>Were you the first to portray William on the BBC? </p>"
				},
				{ 

		 			"id": 29,
		 			"parentid": 16,
		 			"depth": 1,
		 			"age": "504542",
		 			"author": "JohnClarknew",
		 			"posttext": "<p><i>We are talking of Peter Sellers, Eric Sykes, Terry-Thomas etc</i>. Right. We are also talking of <a>Dicky Lupino</a> as William and <a>Roddy McDowell</a> as Ginger. </p>"
				},
				{ 

		 			"id": 30,
		 			"parentid": 29,
		 			"depth": 2,
		 			"age": "477062",
		 			"author": "SchroCat",
		 			"posttext": "<p>\"We are also talking of Andrew Osborn (who?), Esme Percy, Ernest Jay, Zena Marshall and John Barry (no link) in the article\": you are quite right, they were superfluous and I've removed them accordingly. </p>"
				},
				{ 

		 			"id": 31,
		 			"parentid": 29,
		 			"depth": 2,
		 			"age": "500222",
		 			"author": "Irondome",
		 			"posttext": "<p>John. Do you remember taking part in any related early media promotions? Because I appear to have found you. It was a British Pathe newsreel. Its on their archive. But it appears to be dated 1946. The synopsis given to the piece is <b>A look at young \"Just William\" actor John Clark as he relaxes at home. M/S of John appearing in radio show. M/S of John in his garden, he throws a catapault at..</b> Where it breaks off. It can be found at http://www.britishpathe.com/video/just-william-aka-john-clark/.../radio </p>"
				},
				{ 

		 			"id": 32,
		 			"parentid": 31,
		 			"depth": 3,
		 			"age": "496322",
		 			"author": "JohnClarknew",
		 			"posttext": "<p>You will find that external link on the <a>John Clark (actor)</a> article, which is packed with information, including how I got my start with <a>Will Hay</a>. The trouble is, these boys require it to somehow be tied in by direct association with John Le Mesurier. His biographer didn't mention me, didn't have to, and it's from that book, long out of print, from which many of their sourced references come, through page numbers and bibliography. I don't question their expertise with the software, but I do question their use of common sense and their rejection of <a>WP:GF</a>. I am not raising <a>WP:MEAT</a>.</p><p>Just William, the magazine, is the only place it is to be found, with JLM standing behind me in a full cast picture, signed by the entire cast including him. There's also a Radio Times scan of a plug which lists him appearing with me in the play, as it was broadcast live from the stage as the BBC Christmas special in 1946. That should resolve the issue. I would rather someone else enter it, in this instance. </p>"
				},
				{ 

		 			"id": 33,
		 			"parentid": 32,
		 			"depth": 4,
		 			"age": "454262",
		 			"author": "SchroCat",
		 			"posttext": "<p>\"these boys require it to somehow be tied in by direct association\". John, I don't wish to start accusing anyone of falsehood, but this just patently isn't true. The Pathe link has never been mentioned in any of the discussions on the four talk pages, or in the article itself, so to say that other editors require a direct link just isn't true. As an additional point, his main biography (by McCann) is not out of print, it is still very much available. His <i>auto</i>biography is, (as is his wife's autobiography) but we've tried to use that sparingly. None of those three books mention you. As to the question of good faith, you have questioned our good faith on a number of occasions, and it is something I will refute entirely and without reservation. I have no idea why you are questioning my common sense, it seems to just be another in a long line of cheap gibes we have had to put up with since the various discussions started. </p>"
				},
				{ 

		 			"id": 34,
		 			"parentid": 32,
		 			"depth": 4,
		 			"age": "495302",
		 			"author": "Irondome",
		 			"posttext": "<p>John, drop the JLM link. It would appear you have enough notability to be included in a much improved Just William article, whicjh is an excellent subject in the English schoolboy fiction genre. The JLM article is mature, the JW article deserves to be improved. You should be part of a actors portraying William section in an expanded and improved article. I cant keep repeating this. </p>"
				},
				{ 

		 			"id": 35,
		 			"parentid": 32,
		 			"depth": 4,
		 			"age": "499922",
		 			"author": "Irondome",
		 			"posttext": "<p>I have not been able to view it because it is taking forever to download. Its prob my old PC. But there appear to be several links relating to the same newsreel. I assume this would be a reliable source to all concerned. But I do advise that this be used in the <a>Just William</a> article as I mentioned above. I suggest dropping the linkage with JLM. </p>"
				},
				{ 

		 			"id": 36,
		 			"parentid": 35,
		 			"depth": 5,
		 			"age": "490082",
		 			"author": "JohnClarknew",
		 			"posttext": "<p>I will not drop this one, the principle is too important! There's a double standard at work here in WP. I looked at the article on the life of <a>Richmal Crompton</a>. I see a few references at the bottom of the page, but not one single inline citation to support a fact. I know it to be a well-written truthful article. But some users would destroy it by deleting anything not sourced, as they just did with my ex-wife, actress <a>Kay Hawtrey</a>. Which would be a crying shame.</p><p>I have many friends here in Hollywood where I live who are household names, and I can tell you, most of them will have nothing to do with WP because they perceive <a>WP:NPOV</a> editing by <a>fanboys</a>, or haters, depending on who they are, and absolutely none have contributed as I have, because they are intimidated by the software, or they have no interest in real life outside of their performing careers. Mr. Wales needs to know this, which is why I started the discussion here, and I think he does. That is why I believe that ALL BLPers should be not just allowed, but encouraged to edit articles on themselves, always working within the rules of course. I remind them that their obituaries, eventually, will be quoted for free (no copyright) off these pages, wind up at the top of search engines, and they'll be stuck with them. I promote WP wherever I can among my peers, because I think it is a wonderful force for good, but it is always being unfairly slammed in the media. I try to preach for donations. </p>"
				},
				{ 

		 			"id": 37,
		 			"parentid": 36,
		 			"depth": 6,
		 			"age": "477062",
		 			"author": "SchroCat",
		 			"posttext": "<p>There is no principle involved here at all John, and if you are trying to turn this into some sort of <i>cause celebre</i> then you are barking up the wrong tree, I'm afraid. The unsourced addition of your name to the article of another individual on a matter of such infinitesimally minor significance in the life of JLM is one thing. It has nothing to do with whether we as a project start encouraging the circumventing any form of verifiability on the basis that COI editing is beneficial. It will lead to nothing more than skewed self-written hagiographies penned by PR machines on the one hand and open the door to libel actions on the other. </p>"
				},
				{ 

		 			"id": 38,
		 			"parentid": 35,
		 			"depth": 4,
		 			"age": "400622",
		 			"author": "SchroCat",
		 			"posttext": "<p>So how come you've been whining on for the past five days—to the point of being blocked for edit warring—if it didn't exist in the first place? Kinda ironic that really isn't it? I will be able to access the source later to see what McCann shows as the source of his information, although I suspect it may have been JLM's autobiography. BTW, could you stop copying your postings into different locations: I have to say the exact same thing in response to the original posting of this on the article talk page too, which is where this whole conversation belongs. As to your comment that \"one book as your main source is extremely limiting\", we didn't: multiple sources were used. I'm just bloody thankful we didn't rely on the memory of others to discover what they (mis)remember. </p>"
				},
				{ 

		 			"id": 39,
		 			"parentid": 38,
		 			"depth": 5,
		 			"age": "398522",
		 			"author": "JohnClarknew",
		 			"posttext": "<p>I rest my case. And I don't whine, I bray. Congratulations for getting yourself unblocked. </p>"
				},
				{ 

		 			"id": 40,
		 			"parentid": 39,
		 			"depth": 6,
		 			"age": "398222",
		 			"author": "SchroCat",
		 			"posttext": "<p>Yes, I was unblocked because the admin involved realised I had done nothing wrong: I reverted you for a BLP violation, which was adding something unsourced into the article. Good thing too, as it was totally erroneous: you did not appear on radio in 1946, despite your many and long-winded protestations. </p>"
				}
			]
		},
		{
			"topictitle": "Dunbar's number",
			"subscribed" : 0,
			"publictags" : [],
			"privatetags" : [],
			"responses" : [

				{ 

		 			"id": 41,
		 			"parentid": 0,
		 			"depth": 0,
		 			"age": "105423",
		 			"author": "Wavelength",
		 			"posttext": "<p>Editors might optimize their interactions with other editors by considering <a>Dunbar's number</a>. (It was mentioned, in May 2011, in a link near the end of a discussion now archived at <a>User talk:Jimbo Wales/Archive 76#More RfA and Swedish WP lessons</a>.) </p>"
				},
				{ 

		 			"id": 42,
		 			"parentid": 41,
		 			"depth": 1,
		 			"age": "104403",
		 			"author": "Anthonyhcole",
		 			"posttext": "<p>I loved his <i><a>Grooming, Gossip, and the Evolution of Language</a></i>. </p>"
				},
				{ 

		 			"id": 43,
		 			"parentid": 42,
		 			"depth": 2,
		 			"age": "21663",
		 			"author": "Nemo_bis",
		 			"posttext": "<p>Cf. <a>MeatBall:TheTippingPoint</a>. </p>"
				}
			]
		},
		{
			"topictitle": "Possible pitfall in Wikipedia governance",
			"subscribed" : 0,
			"publictags" : [],
			"privatetags" : [],
			"responses" : [

				{ 

		 			"id": 44,
		 			"parentid": 0,
		 			"depth": 0,
		 			"age": "238622",
		 			"author": "Sm8900",
		 			"posttext": "<p>is there some reason that Arbcomm cannot answer some correspondence, posted at <a>Wikipedia_talk:Arbitration/Requests#Mandated Jerusalem discussion appears to be a bureaucratic morass</a>? even when I posted on 3 or 4 personal talk pages for members of Arbcomm? Is this spring break for them or something? :-)</p><p>just wanted to mention this, and to solicit any feedback. I do feel that something about this process might need to be addressed. I appreciate any help, comments, ideas, input, etc etc. :-) thanks. </p>"
				},
				{ 

		 			"id": 45,
		 			"parentid": 44,
		 			"depth": 1,
		 			"age": "231422",
		 			"author": "Jclemens",
		 			"posttext": "<p>1) The correspondent failed to ask a question, or 1a) the correspondent failed to ask a question before everyone's attention span had expired. ArbCom gets probably a couple of emails a week that fall into this category, assuming the distribution hadn't changed. You've all probably seen things like this, where someone essentially gets in a dialogue with themselves, tacks a question on the end of their assumptions and reasoning, and emails the lot to the committee.</p><p>2) The correspondent is disliked, or 2a) the correspondent is feared. These are differentsome people are just plain unpleasant to talk to, because they will just miss the point like they have done before, but others have a track record of trying to harass identified people. 2a doesn't actually happen all that often, but 2 happens all the time, especially in ban appeals.</p><p>3) The committee is not agreed on the answer. This happens when reasonable people post specific questions, and then the arbs have to find consensus on an answer, of some sort, in addition to all the case work, clarification, amendments, CHILDPROTECT matters, misbehaving admins, and OTHER private correspondence.</p><p>The committee has no <a>SLA</a> for private correspondence, such that much of it gets handled on a what-is-the-biggest-threat-to-Wikipedia-right-now basis, by the selected volunteers. You may be ignored not because your question is TL;DR, not because you're disliked, but simply because you've posed a question that needs Arbitrator consensus... and the committee as a whole is working on more important things. </p>"
				},
				{ 

		 			"id": 46,
		 			"parentid": 45,
		 			"depth": 2,
		 			"age": "227942",
		 			"author": "Sm8900",
		 			"posttext": "<p>hmmm, okay. well, thanks for your replies and helpful input on that. {{like}} </p>"
				},
				{ 

		 			"id": 47,
		 			"parentid": 46,
		 			"depth": 3,
		 			"age": "207482",
		 			"author": "Bwilkins",
		 			"posttext": "<p>Was this even an e-mail, or are you simply looking for discussion on <a>this post of yours</a>? It seems like an odd place to start that discussion, in part because it's probably a little-watched corner these days, and it's not a likely place to discuss policy/process changes. If you're waiting for discussion on your idea there, you could be waiting for a long, long time for anyone to stumble across it </p>"
				},
				{ 

		 			"id": 48,
		 			"parentid": 47,
		 			"depth": 4,
		 			"age": "207242",
		 			"author": "Sm8900",
		 			"posttext": "<p>hi. well, I agree with you. Actually the place where I tried to start the discussion is at : <a>Wikipedia_talk:Arbitration/Requests#Mandated Jerusalem discussion appears to be a bureaucratic morass</a>. I should have been clearer about this before. That was in my previous link, but I shouldn't have assumed that everyone could click that.</p><p>if you want, could some of you, please read the note which was left there, and let me klnow what you think?? thanks. still not seeing any replies yet. thanks. </p>"
				},
				{ 

		 			"id": 49,
		 			"parentid": 48,
		 			"depth": 5,
		 			"age": "205802",
		 			"author": "Bwilkins",
		 			"posttext": "<p>Well, as soon as I saw the phrase \"all possible wordings\" I realized that it was unworkable, and I can understand why nobody else replied. Besides, mixing ArbComm and RFC's seems a bit odd ... Not much else to say </p>"
				},
				{ 

		 			"id": 50,
		 			"parentid": 49,
		 			"depth": 6,
		 			"age": "205082",
		 			"author": "Sm8900",
		 			"posttext": "<p>well, I appreciate your reply. however, not sure that I follow your point here. how does the phrase \"all possible wordings\" relate to this item? that is not a part of my idea. I think that the idea is fairly workable. this is a response to the process for an RFC which Arbcomm <i>itself</i> set up. feel free to read the next section there, which further explains it. You can read it at:</p><p><b><a>Wikipedia_talk:Arbitration/Requests#Mandated Jerusalem discussion appears to be a bureaucratic morass</a>.</b></p><p>thanks. </p>"
				},
				{ 

		 			"id": 51,
		 			"parentid": 50,
		 			"depth": 7,
		 			"age": "65762",
		 			"author": "Sm8900",
		 			"posttext": "<p>ok, opened a request for Arbcomm at <b><a>Wikipedia:Arbitration/Requests#Clarification_request:_WP:ARBPIA.2FJerusalem</a>.</b> just letting you know. </p>"
				},
				{ 

		 			"id": 52,
		 			"parentid": 44,
		 			"depth": 1,
		 			"age": "4562",
		 			"author": "Carcharoth",
		 			"posttext": "<p>Just to update matters here. I replied to Steve (Sm8900) at <a>WT:RFAR</a>, and he has now, it seems, found the right page to post at - the best link is <a>Wikipedia:Arbitration/Requests/Clarification and Amendment#Clarification request: WP:ARBPIA/Jerusalem</a>. Apologies for the delayed response, but some of the pages you initially posted to are rather obscure (as others have pointed out). I've asked my fellow arbs and the clerks to help keep an eye on them, though it is difficult to keep track of postings to the pages of closed cases (there are many such pages). To pick up on Jclemens's point about e-mail, some of his observations are true, but in this case no e-mail was received about this. That might, ironically, have produced a faster response. Oh, and on pitfalls, I've never yet seen Wikipedia's governance (ArbCom is not governance, by the way, Wikipedia doesn't really have an established governance system) compared to the inner structure of the Earth, that is a new one on me! :-) I'll now ping my colleagues so they are aware of the clarification request - though it will likely take days to a week before enough arbs will have opined there on what (if anything) is needed. </p>"
				}
			]
		},
		{
			"topictitle": "A Lawsuit",
			"subscribed" : 0,
			"publictags" : [],
			"privatetags" : [],
			"responses" : [

				{ 

		 			"id": 53,
		 			"parentid": 0,
		 			"depth": 0,
		 			"age": "436142",
		 			"author": "JohnClarknew",
		 			"posttext": "<p>CELEBRITY ATTORNEY: My client has been libeled in the pages of Wikipedia in an article written by users who operate under assumed names.</p><p>JUDGE: Libeled? Does your client claim privacy privileges which are quite broad?</p><p>CELEBRITY ATTORNEY: No your honor, he knows that he is vulnerable to general criticism and accepts that. He is what they call a Notable, and as such becomes part of a category called \"Biographies of Living Persons\", and any content may only be changed at the discretion of other users, but not him. That is the crux of this action. He does not accept statements that hold him up to ridicule, scorn, and contempt.</p><p>WP ATTORNEY: My client claims immunity as a public website. It merely passes on what is being said elsewhere. All statements are sourced.</p><p>JUDGE: Does Wikipedia discriminate against any users?</p><p>WP ATTORNEY: Absolutely not. Almost all of its articles can be edited by anyone with access to the site, as we proclaim publicly.</p><p>JUDGE: Can't the plaintiff remove the offending language then?</p><p>CELEBRITY ATTORNEY: No your honor. Under Wikipedia's restrictive rules, celebrities cannot not change anything in articles detailing their lives, beyond possibly a fact here and there. He contravenes what is known as their Conflict of Interest rule, which is a core principle, and which conflicts with their own rules which my friend just stated.</p><p>JUDGE: I see. Then can you state your problem with individual users?</p><p>CELEBRITY ATTORNEY: They don't always provide a source for their unpleasant remarks, and many are the celebrities' fans, and in this case haters. Often-times untrue statements remain unchallenged.</p><p>JUDGE: Then I grant permission for you to bring any such users into court, as I rule they are not exempt.</p><p>CELEBRITY ATTORNEY: But how do I find them?</p><p>JUDGE: That's your problem. (<i>raises gavel</i>)</p><p>WP ATTORNEY: (<i>Quickly</i>) May I confer with my clients?</p><p>(<i>After a short interlude.</i>)</p><p>WP ATTORNEY: I think we can settle this, your honor. My clients are willing to change the rule. They will henceforth include the celebrity and notable BLPers as regular users. Of course, they will then have to conform to the same rules as everybody else.</p><p>JUDGE: Sounds good to me. I will sign an order to that effect. Case dismissed.</p>"
				},
				{ 

		 			"id": 54,
		 			"parentid": 53,
		 			"depth": 1,
		 			"age": "429002",
		 			"author": "JohnClarknew",
		 			"posttext": "<p>Glad you got a handle. </p>"
				},
				{ 

		 			"id": 55,
		 			"parentid": 54,
		 			"depth": 2,
		 			"age": "351842",
		 			"author": "Ukexpat",
		 			"posttext": "<p>Is the above a <a>legal threat</a>?</p>"
				},
				{ 

		 			"id": 56,
		 			"parentid": 55,
		 			"depth": 3,
		 			"age": "241082",
		 			"author": "Herostratus",
		 			"posttext": "<p>I don't think so, because it's A) a warning and not a threat (arguably) and B) not very credible. It doesn't look to have been written by anyone who's been in an actual courtroom. </p>"
				},
				{ 

		 			"id": 57,
		 			"parentid": 56,
		 			"depth": 4,
		 			"age": "179522",
		 			"author": "Wnt",
		 			"posttext": "<p>I thought a class action was when 30 people sued <i>you</i>, not the other way around. But in any case, the COI rule does not actually prohibit <i>appropriate</i> edits to articles. Indeed, we should acknowledge that when a COI editor's goal is to <i>document the truth</i> and <i>correct inaccuracies</i>, there is not actually a conflict of interest at all, according to WP:COI itself! However, I acknowledge that there is nothing more common on Wikipedia than for people to vehemently misread a policy because they find it convenient to, which can apply to anyone on any side of any issue. </p>"
				},
				{ 

		 			"id": 58,
		 			"parentid": 56,
		 			"depth": 4,
		 			"age": "170822",
		 			"author": "JohnClarknew",
		 			"posttext": "<p>No, this is a screenplay for a reality show I'm working on. I'm thinking of casting the celebrity with <a>Alec Baldwin</a>. I will accept casting suggestions from any fellow Wikipedians. I'm pitching it to Fox. </p>"
				},
				{ 

		 			"id": 59,
		 			"parentid": 58,
		 			"depth": 5,
		 			"age": "137282",
		 			"author": "JohnClarknew",
		 			"posttext": "<p>Thanks for your kindness in re-ordering the comments, Delicious. I did slightly change the script as you see, but you reverted it. I'm sure that was a mistake. The reason it is on Mr. Wales's user page is so that he gets to read something that goes to the heart of what I see as a problem that needs to be changed. I understand he has some influence. </p>"
				},
				{ 

		 			"id": 60,
		 			"parentid": 53,
		 			"depth": 1,
		 			"age": "93662",
		 			"author": "JohnClarknew",
		 			"posttext": "<p>I am reverting you for the second time. If you do this again, Carbuncle, you will have become the third revert. That will lead you to (where, Mr. Wales? This is YOUR talk page, not Mr. Carbuncle's). I am tired of your condescending attitude. A central pillar of WP is to use Common Sense. For me to insert the update as a NEW entry will clutter the page, and then you'd be content? Please exercise CS. </p>"
				}
			]
		},
		{
			"topictitle": "Categories as currently implemented are a worthless pain in the ass",
			"subscribed" : 0,
			"publictags" : [],
			"privatetags" : [],
			"responses" : [

				{ 

		 			"id": 61,
		 			"parentid": 0,
		 			"depth": 0,
		 			"age": "267842",
		 			"author": "Looie496",
		 			"posttext": "<p>This point was made above (by MastCell), but it is worth emphasizing. The value of categories is to expedite searching, but Wikipedia's category system is completely divorced from its search system. If you type \"novelists\" into the search box, you don't see anything related to <a>:Category:Novelists</a>. Unless this can be fixed, the whole category system is a worthless waste of effort. </p>"
				},
				{ 

		 			"id": 62,
		 			"parentid": 61,
		 			"depth": 1,
		 			"age": "265982",
		 			"author": "Moonriddengirl",
		 			"posttext": "<p>They're potentially useful for research. I've used them to quickly find articles in a subject area. But they do suffer from and have long suffered from some issues in consistency, and frankly I don't really understand <i>why</i> large parent cats are a problem. </p>"
				},
				{ 

		 			"id": 63,
		 			"parentid": 62,
		 			"depth": 2,
		 			"age": "262562",
		 			"author": "Nomoskedasticity",
		 			"posttext": "<p>They really are <i>potentially</i> useful if they are implemented with the intention of serving as navigational aides. If I click on an author who has been determined guilty of plagiarism and then want to see other instances of plagiarism, it's helpful to have a plagiarism category at the bottom of the first article. The difficulty is that people start thinking about categories (particularly for BLPs) as identity tags. That's not what I have in mind when I work with categories, but that's where the drama and controversy kicks off. </p>"
				},
				{ 

		 			"id": 64,
		 			"parentid": 61,
		 			"depth": 1,
		 			"age": "258662",
		 			"author": "Spanglej",
		 			"posttext": "<p>This is all beside the point. <a> The guidelines specify</a> that \"each categorized page should be placed in all of the most specific categories to which it logically belongs. This means that if a page belongs to a subcategory of C (or a subcategory of a subcategory of C, and so on) then it is not normally placed directly into C\". That is to say, if <a>Sylvia Plath</a> is put in the cat of 'American women poets', she should <i>not</i> also go in 'poets', 'American poets', or 'American writers', which are parent categories. That is why all the American female novelists were in the 'American female novelist' cat but <i>not</i> also listed under 'American novelists', which would be a duplication. If this isn't how categorisation is structured, then you should change the policy. </p>"
				},
				{ 

		 			"id": 65,
		 			"parentid": 61,
		 			"depth": 1,
		 			"age": "255242",
		 			"author": "Moonriddengirl",
		 			"posttext": "<p>I believe this is addressed in <a>WP:Cat gender</a>. Unless \"gender has a specific relation to the topic\" categories by gender are not split; women are in both the specialist and the \"appropriate gender-neutral role category\". </p>"
				},
				{ 

		 			"id": 66,
		 			"parentid": 65,
		 			"depth": 2,
		 			"age": "251222",
		 			"author": "FormerIP",
		 			"posttext": "<p>OK, so we have a guideline that might have prevented this problem. The question is why it didn't, for over two weeks. </p>"
				},
				{ 

		 			"id": 67,
		 			"parentid": 66,
		 			"depth": 3,
		 			"age": "205862",
		 			"author": "Moonriddengirl",
		 			"posttext": "<p>I think it's more a sign that <a>WP:TLDR</a> is a real problem. My <a>WP:AGF</a> presumption is that people don't see it because they don't dig that deep. To get to that page from the main guideline, you have to follow the first link below \"articles\" to <a>Wikipedia:Categorization of people</a> and then to <i>another</i> link below \"By ethnicity, gender, religion, and sexuality\". That said, I agree wholeheartedly that it should be clarified. And I'd really love to understand better <i>why</i> the <a>:Category:American novelists</a> should be depopulated. Is there some technical issue that makes listing all of them alphabetically for easy location impossible? </p>"
				},
				{ 

		 			"id": 68,
		 			"parentid": 61,
		 			"depth": 1,
		 			"age": "247262",
		 			"author": "Wnt",
		 			"posttext": "<p>I agree - we need to <b>fix the category system</b>, period. The limited display sucks, the inability to lump together subcategories into a single list sucks, and just in case someone would be tempted to use templates or Lua to do better, the contents are inaccessible to any kind of transclusion. We end up having these massive 'infoboxes' like <a>Template:The Beatles</a> that spam 200 links into 200 articles because our categories, which should be doing the job, are ugly and unfixable. <i>And</i> yes, we should be able to click on a nationality of our choice <i>and</i> a sex of our choice and a genre of our choice to create a custom intersection of lists. It's something basic the devs should be working on instead of skins and ratings and \"wikilove\". </p>"
				},
				{ 

		 			"id": 69,
		 			"parentid": 61,
		 			"depth": 1,
		 			"age": "113642",
		 			"author": "Johnbod",
		 			"posttext": "<p>There are all sorts of problems with categories, probably the main one being that so many are incomplete, and all sorts of things that it would be great if they could do, but they remain a highly useful and flexible part of the 'pedia, way in advance of what other encyclopedias have. We should celebrate them, and improve them, more than we do, and I deprecate the recent trend to set up bottom templates for everything instead. </p>"
				}
			]
		},
		{
			"topictitle": "WTF?",
			"subscribed" : 0,
			"publictags" : [],
			"privatetags" : [],
			"responses" : [

				{ 

		 			"id": 70,
		 			"parentid": 0,
		 			"depth": 0,
		 			"age": "270842",
		 			"author": "Werieth",
		 			"posttext": "<p>This is just another example of the tendency to micro-categorize pages into sub sub sub categories what makes identifying and finding things via categories almost impossible. If I know X is a novelist and cannot remember the exact name or spelling for some reason I should be able to go to the appropriate category (<a>:Category:Novelists</a>) and find the person. However given the policy and practice to shove the article into the most sub-sub-sub category possible it means I must know that the person is a novelist, their nationality and now gender. Getting a efficient category intersection system would make issues like this null. </p>"
				},
				{ 

		 			"id": 71,
		 			"parentid": 70,
		 			"depth": 1,
		 			"age": "269582",
		 			"author": "Werieth",
		 			"posttext": "<p>You know two things about a song, it was written in 2009 and written by Sean Garrett. Using <a>WP:CATSCAN</a> <a>link to example</a> you can filter the two categories <a>:Category:2009 singles</a> and <a>:Category:Songs written by Sean Garrett</a> from 2,029 items and 52 items respectively to just 7. Without the need to create a category called \"2009 song written by Sean Garrett\" This would enable the ability to find sort and organize articles using large categories and avoid sub-sub-sub categories. </p>"
				},
				{ 

		 			"id": 72,
		 			"parentid": 71,
		 			"depth": 2,
		 			"age": "269642",
		 			"author": "68.87.42.110",
		 			"posttext": "<p>It would probably look like something like Semantic Mediawiki; but you dismissed that years ago as \"too difficult\" or something. </p>"
				},
				{ 

		 			"id": 73,
		 			"parentid": 70,
		 			"depth": 1,
		 			"age": "270362",
		 			"author": "FormerIP",
		 			"posttext": "<p>It looks like it was done earlier this month en masse by a single editor (although I'm not 100% sure, there may have been others doing it). It seems to go wider than just novelists. I've left the editor a talkpage note pointing them here.</p>"
				},
				{ 

		 			"id": 74,
		 			"parentid": 70,
		 			"depth": 1,
		 			"age": "269522",
		 			"author": "FormerIP",
		 			"posttext": "<p>Well, maybe. These were obviously poor edits. But my general impression is that mass changes to categories are not strongly discouraged or well-policed (hence, undoubtedly, the problem here). This could be an editor who's been caught speeding in a zone with no speed limit (i.e. this may be a failing of the community as much as an individual editor). But I'm not experienced with categorisation, so don't take my word for it, I could just be plain wrong. </p>"
				},
				{ 

		 			"id": 75,
		 			"parentid": 74,
		 			"depth": 2,
		 			"age": "268142",
		 			"author": "GTBacchus",
		 			"posttext": "<p>Um, Jimbo, why does the question of banning even come up before it's determined whether the editor in question understands the problem and is willing to work with the community? Is <a>Wikipedia:Assume good faith</a> no longer in effect, or have you already talked with the guy and found him to be intractable? -</p>"
				},
				{ 

		 			"id": 76,
		 			"parentid": 75,
		 			"depth": 3,
		 			"age": "269282",
		 			"author": "FormerIP",
		 			"posttext": "<p>@The Devil's Advocate: Maybe, but dividing a category into people and women gives an obvious cause for concern. </p>"
				},
				{ 

		 			"id": 77,
		 			"parentid": 76,
		 			"depth": 4,
		 			"age": "268742",
		 			"author": "FormerIP",
		 			"posttext": "<p>No, that isn't how it happened. The category for \"American men novelists\" has been created in response to the NYT piece. Originally, all the women writers had been moved into \"American women novelists\". What the NYT describes looks to be basically accurate in terms of a description of the situation a day ago. </p>"
				},
				{ 

		 			"id": 78,
		 			"parentid": 77,
		 			"depth": 4,
		 			"age": "268382",
		 			"author": "Elysdir",
		 			"posttext": "<p>As of last night, very few of the \"American women novelists\" were in \"American novelists,\" largely due to one editor removing them from \"American novelists.\" Some of us have been re-adding them over the past twelve hours or so, which is why a lot of them are back now. </p>"
				},
				{ 

		 			"id": 79,
		 			"parentid": 78,
		 			"depth": 5,
		 			"age": "267902",
		 			"author": "AndyTheGrump",
		 			"posttext": "<p>If he can't come up with a darned good reason why he did it - one that is in the direct interest of our readership - he should be. </p>"
				},
				{ 

		 			"id": 80,
		 			"parentid": 79,
		 			"depth": 6,
		 			"age": "267122",
		 			"author": "GTBacchus",
		 			"posttext": "<p>Well, why not examine his contributions to the discussion yourself before passing judgment? He's not only given an explanation for his behavior, based on precedent, but he's also offering constructive suggestions on how to address the problem. Is that really the kind of editor we're trying to get rid of? -</p>"
				},
				{ 

		 			"id": 81,
		 			"parentid": 77,
		 			"depth": 4,
		 			"age": "268502",
		 			"author": "AndyTheGrump",
		 			"posttext": "<p>Yup. Shoving people into boxes and labelling them, even metaphorically, is a nasty little habit. It is high time Wikipedia grew up and stopped doing it. And no, I'm not kidding... </p>"
				},
				{ 

		 			"id": 82,
		 			"parentid": 81,
		 			"depth": 5,
		 			"age": "244142",
		 			"author": "Anthonyhcole",
		 			"posttext": "<p>Since we aspire to host the sum of all human knowledge, it's probably an unavoidable duty that we involve ourselves in the taxonomy of knowledge. I agree with you both that the way we presently do it, particularly with regard to human and social types, needs improving. I agree with <a>Looie's and Wnt's comments</a> about usability, too. </p>"
				},
				{ 

		 			"id": 83,
		 			"parentid": 73,
		 			"depth": 1,
		 			"age": "268442",
		 			"author": "Carrite",
		 			"posttext": "<p>The problem is that someone took it upon themselves to exclude members of the subset American Female Authors from the universal set American Authors. This should be a learning experience why this kind of thing should not be done. There is nothing wrong with that subset, there is a legitimate academic concern with that subset. But making membership in Group A in any way related to inclusion in Group B creates a ghetto and controversy. A person can be part of categories \"People born in 1926,\" \"People from Duluth,\" \"Swedish-Americans,\" \"American female novelists,\" and \"American novelists\" — all 5. The last two are not and should not be regarded as mutually exclusive. If there is a structural reason why this happened, it should be fixed. If this was done by individual volition, it should be stopped. </p>"
				},
				{ 

		 			"id": 84,
		 			"parentid": 73,
		 			"depth": 1,
		 			"age": "266882",
		 			"author": "AndyTheGrump",
		 			"posttext": "<p>If an experienced Wikipedia editor sincerely thinks that removing women from 'category:American novelists' is an improvement, I sincerely think that we should get rid of him. And I sincerely think that arguing otherwise is missing the point. No matter how you spin it, it is detrimental to the credibility of Wikipedia. And just plain stupid. </p>"
				},
				{ 

		 			"id": 85,
		 			"parentid": 84,
		 			"depth": 2,
		 			"age": "266582",
		 			"author": "Moonriddengirl",
		 			"posttext": "<p>Why wouldn't he think that, when the category says right on it that \"It should directly contain very few, if any, articles and should mainly contain subcategories\"? People are <i>encouraged</i> to move articles from these parents cats to subcats. <a>Leon Uris</a> isn't at this writing in that category. Why? He's been subcatted. I don't think it's a good decision to remove women only (or even first) or that it's a good decision to put women solely in categories related to gender (as opposed to the handling of <a>Pearl S. Buck</a>, where she is categorized as an author in several ways...but not at this writing, like Leon, in the parent cat). </p>"
				},
				{ 

		 			"id": 86,
		 			"parentid": 85,
		 			"depth": 3,
		 			"age": "266522",
		 			"author": "Moonriddengirl",
		 			"posttext": "<p>Oh, re: Pearl, <a>I stand corrected</a>; she's been added. Possibly in response to an email I sent out via OTRS a few hours ago. :) </p>"
				},
				{ 

		 			"id": 87,
		 			"parentid": 73,
		 			"depth": 1,
		 			"age": "266642",
		 			"author": "Coffeepusher",
		 			"posttext": "<p>Sorry to intrude, but here is the link to the current discussion. <a>Wikipedia:Categories for discussion/Log/2013 April 24#Category:American women novelists</a>. I may have missed it but I haven't been able to find the link in the above discussion so I thought it may be important. Carry on, and mind the gap. </p>"
				},
				{ 

		 			"id": 88,
		 			"parentid": 87,
		 			"depth": 2,
		 			"age": "266522",
		 			"author": "GTBacchus",
		 			"posttext": "<p>Thank you. There's also <a>Category talk:American novelists#Preferred gender classification style</a>. -</p>"
				},
				{ 

		 			"id": 89,
		 			"parentid": 87,
		 			"depth": 2,
		 			"age": "266582",
		 			"author": "Ukexpat",
		 			"posttext": "<p>Same issue with actors/actresses - <a>:Category:American actresses</a> is a sub-cat of <a>:Category:American actors</a>.</p>"
				},
				{ 

		 			"id": 90,
		 			"parentid": 87,
		 			"depth": 2,
		 			"age": "266342",
		 			"author": "AndyTheGrump",
		 			"posttext": "<p>And needless to say, <a>:Category:African-American television actors</a> is a subcat of <a>:Category:American television actors</a>. </p>"
				},
				{ 

		 			"id": 91,
		 			"parentid": 90,
		 			"depth": 2,
		 			"age": "266102",
		 			"author": "FormerIP",
		 			"posttext": "<p>These are also down to the same editor, it seems. </p>"
				},
				{ 

		 			"id": 92,
		 			"parentid": 91,
		 			"depth": 3,
		 			"age": "265622",
		 			"author": "FormerIP",
		 			"posttext": "<p>To clarify, he didn't create these categories, just moved actors into them. </p>"
				},
				{ 

		 			"id": 93,
		 			"parentid": 92,
		 			"depth": 4,
		 			"age": "265442",
		 			"author": "FormerIP",
		 			"posttext": "<p>OK, actually he did create the actresses category. But I think we should focus less on the editor, beyond understanding that the problem is about a lack of community oversight. </p>"
				},
				{ 

		 			"id": 94,
		 			"parentid": 93,
		 			"depth": 5,
		 			"age": "248282",
		 			"author": "AndyTheGrump",
		 			"posttext": "<p>\"We do have categories for non-Africans by occupation\"!!!!!!!!! Holy shit!!!!!! Now I've seen everything. Or rather, I haven't. Could you provide some examples... </p>"
				},
				{ 

		 			"id": 95,
		 			"parentid": 94,
		 			"depth": 6,
		 			"age": "243482",
		 			"author": "AndyTheGrump",
		 			"posttext": "<p>Er, no. I asked specifically for a <a>:Category:non-African...</a>, as the logical subcategory to go with <a>:Category:African...</a> - you have merely provided further evidence of Ghettoisation. (Though I have spotted a horrific WP:BLP violation in the entirely obnoxious <a>:Category:Chechen criminals</a>, so I suppose I should be thankful...). </p>"
				},
				{ 

		 			"id": 96,
		 			"parentid": 95,
		 			"depth": 7,
		 			"age": "261722",
		 			"author": "Thelmadatter",
		 			"posttext": "<p>General rules of categorization would indicate that if we subdivide for women, we should subdivide for men as well. However, given all the attention that \"women\" get (Women's studies but no Men's studies, not to mention efforts to reward women based on the fact that they ARE women, rather than just on their accomplishments - such as some of our own programs here with Wikipedia) Im not all that surprised that someone made subcategories for women but not for men. To me, its not \"ghettoizing\" its giving women special status whereas male writers for example are not somehow special because they are men. Similarly, how many times do you see someone noted as a \"gay\" writer but never as a hetero one. While I agree that we should have a men's category, I dont think the preachiness or self righteousness is really warranted. Make the category and move on.</p>"
				}
			]
		},
		{
			"topictitle": "Category intersections by CatScan or wikisearch incategory",
			"subscribed" : 0,
			"publictags" : [],
			"privatetags" : [],
			"responses" : [

				{ 

		 			"id": 131,
		 			"parentid": 0,
		 			"depth": 0,
		 			"age": "27483",
		 			"author": "Wikid77",
		 			"posttext": "<p>Hence, among the 685 pages in \"<a>:Category:People from Queens</a>\" (NYC), this palenotologist's name was matched, as \"<a>Stephen Jay Gould</a>\". Although the wikisearch categories do not also scan the related sub-categories, there is a <a>wp:Toolserver</a> tool, <a>wp:CatScan</a> to scan for articles which also match within the sub-categories. Those features seem to handle over 90% of what people have requested for category-intersection lists. -</p>"
				},
				{ 

		 			"id": 132,
		 			"parentid": 131,
		 			"depth": 1,
		 			"age": "14463",
		 			"author": "FormerIP",
		 			"posttext": "<p>I had no idea the search allowed you to do that. Presumably, it would be relative child's play to set up a form (?) </p>"
				},
				{ 

		 			"id": 133,
		 			"parentid": 131,
		 			"depth": 1,
		 			"age": "14883",
		 			"author": "GabrielF",
		 			"posttext": "<p>One feature that would be nice would be a NOT operator so you could search for articles that were in category A but not in category B. A use case would be to easily add articles to WikiProjects. It would be nice to be able to generate a list of articles in <a>:Category:2000 novels</a> but not in <a>:Category:WikiProject Novels articles</a>. I could easily add the articles in this list to WikiProject Novels. </p>"
				},
				{ 

		 			"id": 134,
		 			"parentid": 131,
		 			"depth": 1,
		 			"age": "903",
		 			"author": "Carcharoth",
		 			"posttext": "<p>I have a vague memory of when the search interface was updated to include such things. I've used the \"intitle\" search operator for some time, but not many people seemed to have noticed the changes. It might be worth pinpointing when the changes was made, and also notifying the people elsewhere on this talk page and in other places who are in uproar about the categorisation system. Those who have any experience with the categorisation system (I did for a few years about five years ago) are probably a bit shocked at how many people don't really follow how it works at all, and the amount of misunderstanding going on around this. </p>"
				}
			]
		}
	]
}
